Revit 2024 API
ConnectionInputPointInfo Properties
The ConnectionInputPointInfo type exposes the following members.
Properties
Name | Description
InputMemberIndex
 A index of the input member to which the restriction applies.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
PointSelectionText
 A string used to select input point by some connections.
RestrictionType
 A type of input point restriction.
See Also
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace